# 编写程序，输入两个数相加并打印出结果
#a = int(input(f"请输入第一个数字:"))
#b = int(input(f"请输入第二个数字:"))
#print(f"{a} + {b} = {a+b}")

import random
z = list('刀' '枪' '枪' '枪' '三' '三' '三' '三' '三' '三' '三' '三' '三' '三' '三' '三' '三' '三' '三' '三' '三' '三' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '十' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '五' '挂' '挂' '挂' '挂' '挂' '挂' '挂' '挂' '挂' '挂' '挂' '挂' '喷' '喷' '喷' '喷' '喷' '喷' '喷' '喷' '喷' '喷' '喷' '喷')

y = list('三' '枪' '刀' )






a= int(input(f"请输入第一个数字:"))

if a==1:
    print(random.choice(z))
else:
    print(random.choice(y))