# 编写程序，实现两数相加，并打印结果。
#a = 1
#b = 1
#x = (a+b)
#print(f"{a} + {b} 的结果是 {x}")

#z = list['机密文件' '金狮雕像' '金狮雕像' '金狮雕像' '金狮雕像' '茶壶' '茶壶' '茶壶' '茶壶' '茶壶' '茶壶' '金豹子' '金豹子' '金豹子' '金豹子' '金豹子' '金豹子' '金豹子' '金豹子' '金豹子' '金豹子' '金豹子' '金豹子' '金豹子' '金豹子' '金豹子' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '拐杖' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '石膏雕像' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '机油' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币' '柯恩币']














#a= int(input(f"请输入第一个数字:"))

#if a==1:
   #random.choice(z)





n = int(input(f"请输入一个数字:"))

for x in range (1, n+1):
     for z in range (1, n-x+1):
          print(" ", end="")
     for y in range (0, 2*x-1):
          print("*", end="")
     print("\n")







